{
  "login": {
    "app-name": "Wild Knight",
    "username": "Enter your username or email",
    "password": "Enter your password",
    "login-button": "Log in",
    "reset-password": "Reset password",
    "create-account": "Create account",
    "google-login": "Continue with Google"
  },
  "or-separator": "or",
  "reset-password": {
    "title": "Reset password",
    "description": "Give us your email and we will send you a link to reset your password",
    "email": "Enter your email",
    "button": "Reset password"
  },
  "content": {
    "see-offline-content": "See our offline Hiker guides",
    "title": "Offline guides",
    "guide-1": {
      "title": "Essential Gear for Every Hiker",
      "content": "Before you set out on your hiking adventures, it’s crucial to have the right gear. The essentials start with a sturdy pair of hiking boots that provide good ankle support and have a solid grip. Break them in before hitting the trail to avoid blisters. Alongside your boots, a comfortable backpack is key. Opt for one with multiple compartments and a hydration reservoir to keep your gear organized and water accessible.\n\nNext, dress in layers to prepare for changing weather conditions. Start with moisture-wicking base layers to keep sweat away from your skin, add insulating mid-layers for warmth, and finish with a waterproof, windproof outer layer. Don’t forget a hat and gloves, even in warmer weather, as temperatures can drop unexpectedly, especially at higher elevations. Include a sun hat and sunglasses to protect against UV rays, and consider wearing gaiters to keep debris out of your boots.\n\nOther must-haves include a reliable map and compass or a GPS device. Learning to use these tools effectively is crucial for navigating unfamiliar terrain. A first aid kit is indispensable; it should include bandages, antiseptics, blister treatment, and any personal medications. A multi-tool can be a lifesaver for various tasks, from gear repair to food preparation. Lastly, pack high-energy snacks such as nuts, dried fruit, and energy bars, along with plenty of water to stay fueled and hydrated throughout your hike. Consider carrying a water filter or purification tablets if you'll be hiking near natural water sources."
    },
    "guide-2": {
      "title": "Map Reading and Compass Skills",
      "content": "Understanding how to read a map and use a compass is an essential skill for any hiker, ensuring you can navigate safely through unfamiliar terrain. Start by familiarizing yourself with topographic maps, which show the shape and features of the land. Learn to read contour lines, which indicate elevation changes, and understand the map’s legend and scale. Pay attention to symbols for trails, water sources, and landmarks.\n\nUsing a compass in conjunction with a map can help you pinpoint your location and find your way. Begin by setting your map to true north, aligning the north on the map with the north on your compass. Practice taking bearings by pointing the compass at a landmark and reading the degrees. Then, use this bearing to navigate by keeping the red needle on the compass aligned with the direction of travel arrow. Regularly check your position against the map to ensure you stay on course, and make note of any changes in terrain or direction.\n\nFor more advanced navigation, learn to triangulate your position using landmarks. This involves taking bearings on two or more distinct features and plotting them on your map to find your exact location. Practice these skills in a safe environment before relying on them in the wilderness. Additionally, consider learning how to use a GPS device or a smartphone app designed for hiking, as these can provide valuable backup information. However, always carry a physical map and compass, as electronic devices can fail or run out of battery."
    },
    "guide-3": {
      "title": "Tips for Wilderness Survival",
      "content": "Hiking can sometimes take unexpected turns, so knowing basic wilderness survival skills is vital. Start with understanding the principles of Leave No Trace, which help preserve the natural environment. Always tell someone your plans, including your route and expected return time, to ensure someone knows where you are.\n\nIf you get lost, remember the STOP principle: Stop, Think, Observe, and Plan. Avoid panicking and stay put if possible. Use your map and compass to reorient yourself. In case of an emergency, having a whistle, signal mirror, or flare can help rescuers find you. Learn how to build a shelter using natural materials like branches and leaves, or carry a lightweight emergency shelter. Knowing how to start a fire using a fire starter kit or waterproof matches is crucial for warmth and signaling. Practice these skills before your hike.\n\nStaying hydrated is critical, so know how to find and purify water in the wild. Carry a water filter, purification tablets, or learn how to boil water effectively. Familiarize yourself with edible plants and basic foraging, but also know which plants to avoid. Understanding how to deal with wildlife encounters, such as bear or snake safety, can also prevent dangerous situations. Lastly, always carry a well-stocked first aid kit and know basic first aid procedures for treating injuries, hypothermia, and heat exhaustion."
    },
    "guide-4": {
      "title": "Respecting Nature and Fellow Hikers",
      "content": "Good trail etiquette ensures a pleasant experience for everyone on the trail. Always yield to uphill hikers and step aside to let them pass. When hiking in a group, keep to a single file on narrow trails and avoid blocking the path. If you bring pets, keep them on a leash and under control at all times. Ensure that your pets are also trail-ready and carry enough supplies for them.\n\nRespect wildlife by observing from a distance and never feeding animals. Stick to designated trails to protect fragile ecosystems and avoid damaging vegetation. Pack out all trash, including biodegradable items like fruit peels, and follow the Leave No Trace principles to minimize your impact on the environment. This includes properly disposing of human waste by digging a cathole at least 6-8 inches deep and at least 200 feet away from water sources, trails, and campsites.\n\nGreeting fellow hikers with a friendly nod or hello can enhance the sense of community on the trail. Be considerate of noise levels to preserve the tranquility of nature for others. If you encounter mountain bikers or horseback riders, step to the downhill side of the trail to give them the right of way. Remember that trail etiquette also involves being prepared and self-sufficient, carrying all the necessary gear to avoid having to rely on others in an emergency."
    },
    "guide-5": {
      "title": "Conditioning Your Body for the Trail",
      "content": "Preparing your body for the physical demands of hiking can enhance your experience and reduce the risk of injury. Start with cardiovascular exercises like walking, running, or cycling to build stamina. Aim for at least 30 minutes of cardio three times a week, gradually increasing the intensity and duration as your fitness improves.\n\nStrength training is also essential, focusing on your legs, core, and upper body. Exercises like squats, lunges, and planks can improve your stability and endurance on uneven terrain. Add weight training to strengthen muscles that support your joints, such as your quadriceps, hamstrings, and calves. Incorporate flexibility exercises such as yoga or stretching routines to increase your range of motion and prevent stiffness, which can be particularly beneficial after long hikes.\n\nBefore hitting the trail, do a few practice hikes with a loaded backpack to simulate real conditions. Gradually increase the distance and difficulty of your hikes to build confidence and physical readiness. Hydrate well and fuel your body with nutritious foods to maintain energy levels during your hikes. Pay attention to your body and rest if you feel any pain or discomfort to avoid overuse injuries. Additionally, learning proper hiking techniques, such as how to ascend and descend steep terrain, can help you move more efficiently and reduce strain on your body."
    }
  },
  "signup": {
    "title": "Sign up",
    "username": "Enter your username",
    "email": "Enter your email",
    "password": "Enter your password",
    "password-strength": "Password Strength: ",
    "signup-button": "Sign up",
    "google-login": "Continue with Google",
    "phone-number": "Enter your phone number"
  },
  "password-suggestions": {
    "length": "Please include at least 8 characters",
    "upper-lower": "Please include at least one uppercase and one lowercase letter",
    "number": "Please include at least one number",
    "special": "Please include at least one special character",
    "too-weak": "Password is too weak",
    "weak": "Password is weak",
    "moderate": "Password is moderate",
    "strong": "Password is strong",
    "very-strong": "Password is very strong"
  },
  "map": {
    "permission-denied": "Permission to access location denied",
    "permission-not-granted": "Location permission not granted",
    "marker-title": "Current location",
    "order-button": "Order",
    "pending-orders-button": "Pending orders"
  },
  "items": {
    "first-aid": "First aid kit",
    "first-aid-description": "Constains bandages, plasters, rubbing alcohol, asthma pump.",
    "flashlight": "Flashlight",
    "flashlight-description": "1000 lumens. Powered by two AA batteries.",
    "thermal-blanket": "Thermal blanket",
    "thermal-blanket-description": "Made of reflective material to contain body heat.",
    "powerbank": "Power bank",
    "powerbank-description": "20000 mAh battery. USB-C, lightning and USB-A connections."
  },
  "order-placed": {
    "arriving-at": "Arriving at",
    "on-its-way": "Your order is on its way",
    "order-summary": "Order summary",
    "location": "Location: ",
    "order-complete": "Your order should have been delivered",
    "thanks": "Thanks for trusting us",
    "view-order-history": "View order history"
  },
  "order-history": {
    "title": "Order history"
  },
  "order-menu": {
    "choose-item": "Choose an item"
  },
  "global": {
    "loading": "Loading...",
    "wait": "Please wait..."
  }
}
